from telebot import types

TOKEN = '5217065698:AAFjvuoZdtSqa1dCfZlz9dOdRGgt0sTa2dg'

HOSTNAME = 'localhost'
DATABASE = 'military'
USERNAME = 'postgres'
PWD = '123'
PORT_ID = 5432

query = {
    '/who_am_i': 'who_am_i',  # Уставное обращение к военнослужащему
    '/buildings': 'buildings',  # Строения воинских частях
    '/speciality': 'speciality',  # Специальности военнослужащих в округе
    '/property': 'property'  # Имущество подразделений
}

# user_id
# id_военнослужащего
registred_user = {}

# логин
# пароль
# id_военнослужащего
users = [['', '7збъ', 149],  # Командир военного округа

         ['', 'я9г3', 62],  # Командир ВЧ----1
         ['', 'шрвс', 61],  # Командир Р---1
         ['', '7пч9', 17],  # Командир В-1
         ['', 'сяжв', 25],  # Командир В-2
         ['', '9щу1', 45],  # Командир В-3
         ['', 'вфвй', 63],  # Командир Р---2
         ['', 'хьпф', 64],  # Командир В-1
         ['', 'рцёя', 65],  # Командир В-2
         ['', 'ндх7', 66],  # Командир В-3

         ['', 'яр2с', 122],  # Командир ВЧ----2
         ['', '40н9', 123],  # Командир Р---1
         ['', 'жшхн', 125],  # Командир В-1
         ['', 'ия1ы', 126],  # Командир В-2
         ['', 'о033', 127],  # Командир В-3
         ['', 'е52н', 124],  # Командир Р---2
         ['', 'лхаы', 128],  # Командир В-1
         ['', 'кк7е', 129],  # Командир В-2
         ['', 'вы1ё', 130],  # Командир В-3

         ['', 'юд82', 4],  # ВЧ1 Р1 В1 О1 Василий
         ['', '53ер', 238],  # ВЧ2 Р2 В3 О3 Владимир
         ['', '4усл', 115],  # ВЧ1 Р2 В3 О2 Матвей
         ['', 'оягб', 186],  # ВЧ2 Р1 В3 О2 Тимофей
         ['', 'нвъч', 109],  # ВЧ1 Р2 В3 О1 Семён
         ['', 'умд1', 209],  # ВЧ2 Р2 В1 О3 Игорь
         ['', 'чсйж', 84],  # ВЧ1 Р2 В1 О2 Влад

         ['', '100', 100],
         ['', '101', 101],
         ['', '102', 102],
         ['', '103', 103],
         ['', '104', 104],
         ['', '105', 105],
         ['', '106', 106],
         ['', '107', 107],
         ['', '108', 108],
         ['', '109', 109],
         ['', '110', 110],
         ['', '111', 111],
         ['', '112', 112],
         ['', '113', 113],
         ['', '114', 114],
         ['', '115', 115],
         ['', '116', 116],
         ['', '117', 117],
         ['', '118', 118],
         ['', '119', 119],
         ['', '120', 120],
         ['', '121', 121],
         ['', '122', 122],
         ['', '123', 123],
         ['', '124', 124],
         ['', '125', 125],
         ['', '126', 126],
         ['', '127', 127],
         ['', '128', 128],
         ['', '129', 129],
         ['', '130', 130],
         ['', '131', 131],
         ['', '132', 132],
         ['', '133', 133],
         ['', '134', 134],
         ['', '135', 135],
         ['', '136', 136],
         ['', '137', 137],
         ['', '138', 138],
         ['', '139', 139],
         ['', '140', 140],
         ['', '141', 141],
         ['', '142', 142],
         ['', '143', 143],
         ['', '144', 144],
         ['', '145', 145],
         ['', '146', 146],
         ['', '147', 147],
         ['', '148', 148],
         ['', '149', 149],
         ['', '150', 150],
         ['', '151', 151],
         ['', '152', 152],
         ['', '153', 153],
         ['', '154', 154],
         ['', '155', 155],
         ['', '156', 156],
         ['', '157', 157],
         ['', '158', 158],
         ['', '159', 159],
         ['', '160', 160],
         ['', '161', 161],
         ['', '162', 162],
         ['', '163', 163],
         ['', '164', 164],
         ['', '165', 165],
         ['', '166', 166],
         ['', '167', 167],
         ['', '168', 168],
         ['', '169', 169],
         ['', '170', 170],
         ['', '171', 171],
         ['', '172', 172],
         ['', '173', 173],
         ['', '174', 174],
         ['', '175', 175],
         ['', '176', 176],
         ['', '177', 177],
         ['', '178', 178],
         ['', '179', 179],
         ['', '180', 180],
         ['', '181', 181],
         ['', '182', 182],
         ['', '183', 183],
         ['', '184', 184],
         ['', '185', 185],
         ['', '186', 186],
         ['', '187', 187],
         ['', '188', 188],
         ['', '189', 189],
         ['', '190', 190],
         ['', '191', 191],
         ['', '192', 192],
         ['', '193', 193],
         ['', '194', 194],
         ['', '195', 195],
         ['', '196', 196],
         ['', '197', 197],
         ['', '198', 198],
         ['', '199', 199],
         ['', '200', 200],
         ['', '201', 201],
         ['', '202', 202],
         ['', '203', 203],
         ['', '204', 204],
         ['', '205', 205],
         ['', '206', 206],
         ['', '207', 207],
         ['', '208', 208],
         ['', '209', 209],
         ['', '210', 210],
         ['', '211', 211],
         ['', '212', 212],
         ['', '213', 213],
         ['', '214', 214],
         ['', '215', 215],
         ['', '216', 216],
         ['', '217', 217],
         ['', '218', 218],
         ['', '219', 219],
         ['', '220', 220],
         ['', '221', 221],
         ['', '222', 222],
         ['', '223', 223],
         ['', '224', 224],
         ['', '225', 225],
         ['', '226', 226],
         ['', '227', 227],
         ['', '228', 228],
         ['', '229', 229],
         ['', '230', 230],
         ['', '231', 231],
         ['', '232', 232],
         ['', '233', 233],
         ['', '234', 234],
         ['', '235', 235],
         ['', '236', 236],
         ['', '237', 237],
         ['', '238', 238],
         ['', '239', 239]]

# это флаг для отдачи приказа
# кто отдаёт
# кому отдаёт
command = []

# кто
# кому
# что
later = []

# клавиатуры
menu_key = types.InlineKeyboardMarkup()
menu_key.add(types.InlineKeyboardButton(text='Личное дело', callback_data='private'))
menu_key.add(types.InlineKeyboardButton(text='Личный состав', callback_data='personnel'))
menu_key.add(types.InlineKeyboardButton(text='Начальники', callback_data='commanders'))
menu_key.add(types.InlineKeyboardButton(text='Выход', callback_data='exit'))

back_key = types.InlineKeyboardMarkup()
back_key.add(types.InlineKeyboardButton(text='Назад', callback_data='home'))
